# input()

'''
型態 : 數字
       文字:   用雙/單 引號包起來

'''

'''
情形1
我交待值日生做事

我們可以用變數儲存
'''
# a = "黨小姐"
# print("值日生",a ,"，打掃")
# print("值日生 ",a ,"，拖地")
# print("值日生 ",a ,"，關門")
'''
請你輸入 名字
印出 祝 名子 生日快樂
'''
# a = "黨靖騰"
# print("祝",a ,"生日快樂")


'''
電腦計算
+
-
*
/
**
//  :取商數
%   :取餘數

'''

# print(5**5)


'''
用一個變數儲存 10 mod 2 結果
印出結果


'''
# a=10%2
# print(a)

'''
輸入 數字 mod 3
印出結果

'''

# a=input()
# a = int(a)
# print(a % 3)

'''
遇到錯誤 怎麼辦?

debug   調試/除錯

先看錯誤訊息， 嘗試理解

如何查看變數的儲存值的 型態
type()

字串 -> 數字
int()
'''


'''
文字 運算
+   :兩邊都是文字
*   :左邊是文字 右邊是數字
'''
# print("我"+"我")
# print(100*"我")
# print("我"+"10" + "mod" + "2" +"=" + "0")

'''
輸入 數字 mod 3
印出結果 按照 print("我"+"10" + "mod" + "2" +"=" + "0")
int() :轉整數
str()  :轉文字
'''
# a=input()
# a = int(a)
# print(a % 3)
# a = input()
# a = int(a)
# print("我"+ str(a) + "mod" + "3" +"=" + str(a%3))
# print("我"+ a + "mod" + "3" +"=" + str(a%3))

a = input()
int(a)
print(type(a))

a = input()
a = int(a)
str(a)
print(type(a))